src/test/resources/api_fixtures/subscription_with_discount_objects.json

{
  "id": "sub_123",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1500251956,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "created": 1500251956,
  "current_period_end": 1502930356,
  "current_period_start": 1500251956,
  "customer": "cus_123",
  "days_until_due": null,
  "discount": null,
  "discounts": [
    {
      "object": "discount",
      "id": "foo",
      "coupon": {
        "id": "foo",
        "object": "coupon",
        "amount_off": null,
        "created": 1588174211,
        "currency": "usd",
        "duration": "repeating",
        "duration_in_months": 3,
        "livemode": false,
        "max_redemptions": null,
        "metadata": {},
        "name": "foo",
        "percent_off": 25.5,
        "redeem_by": null,
        "times_redeemed": 0,
        "valid": true
      },
      "customer": "cus_HBfBGo7CrHdTCy",
      "end": 1596036611,
      "start": 1588174211,
      "subscription": null
    },
    {
      "object": "discount",
      "id": "bar",
      "coupon": {
        "id": "bar",
        "object": "coupon",
        "amount_off": null,
        "created": 1588174211,
        "currency": "usd",
        "duration": "repeating",
        "duration_in_months": 3,
        "livemode": false,
        "max_redemptions": null,
        "metadata": {},
        "name": "bar",
        "percent_off": 35.5,
        "redeem_by": null,
        "times_redeemed": 0,
        "valid": true
      },
      "customer": "cus_HBfBGo7CrHdTCy",
      "end": 1596036611,
      "start": 1588174211,
      "subscription": null
    }
  ],
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_123",
        "object": "subscription_item",
        "created": 1500251957,
        "metadata": {
        },
        "plan": {
          "id": "pl_123",
          "object": "plan",
          "amount": 5000,
          "billing_scheme": "per_unit",
          "created": 1500234842,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {
          },
          "nickname": null,
          "product": "prod_123",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed",
          "statement_descriptor": null,
          "name": "plan for raw pans",
          "statement_description": null
        },
        "quantity": 1,
        "subscription": "sub_123"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_123",
    "count": 1
  },
  "livemode": false,
  "metadata": {
  },
  "plan": {
    "id": "pl_123",
    "object": "plan",
    "amount": 5000,
    "billing_scheme": "per_unit",
    "created": 1500234842,
    "currency": "usd",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {
    },
    "nickname": null,
    "product": "prod_123",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed",
    "statement_descriptor": null,
    "name": "plan for raw pans",
    "statement_description": null
  },
  "quantity": 1,
  "start": 1500251956,
  "status": "active",
  "tax_percent": null,
  "trial_end": null,
  "trial_start": null
}
